## Use an API to extract box office financial data and load it into your database.

In [1]:
# Standard Imports
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
# Additional Imports
import os, json, math, time, glob
from tqdm.notebook import tqdm_notebook
import tmdbsimple as tmdb

In [2]:
with open('/Users/yupfj/.secret/tmdb_api.json') as f:
    login = json.load(f)
## Display the keys of the loaded dict
login.keys()

dict_keys(['client-id', 'api-key'])

In [3]:
# Instantiate tmdbAPI
tmdb.API_KEY = login['api-key']
# Create the folder for saving files (if it doesn't exist)
FOLDER = "Data/"
os.makedirs(FOLDER, exist_ok=True)

In [4]:
def create_json_file(JSON_FILE, delete_if_exists=False):
    
    ## Check if JSON_FILE exists
    file_exists = os.path.isfile(JSON_FILE)
    
    ## If it DOES exist:
    if file_exists == True:
        
        ## Check if user wants to delete if exists
        if delete_if_exists==True:
            
            print(f"[!] {JSON_FILE} already exists. Deleting previous file...")
            ## delete file and confirm it no longer exits.
            os.remove(JSON_FILE)
            ## Recursive call to function after old file deleted
            create_json_file(JSON_FILE, delete_if_exists=False)
        else:
            print(f"[!] {JSON_FILE} already exists.")            
            
    ## If it does NOT exist:
    else:
        
        ## INFORM USER AND SAVE EMPTY LIST
        print(f"[!] {JSON_FILE} not found. Saving empty list to new file.")
        
        ## CREATE ANY NEEDED FOLDERS
        # Get the Folder Name only
        folder = os.path.dirname(JSON_FILE)

        ## If JSON_FILE included a folder:
        if len(folder)>0:
            # create the folder
            os.makedirs(folder,exist_ok=True)
        ## Save empty list to start the json file
        with open(JSON_FILE,'w') as f:
            json.dump([{'imdb_id':0}],f)  

def get_movie_with_rating(movie_id):
    # Get the movie object for the current id
    movie = tmdb.Movies(movie_id)
    
    # save the .info .releases dictionaries
    movie_info = movie.info()
    releases = movie.releases()
    
    # Loop through countries in releases
    for c in releases['countries']:
        # if the country abbreviation==US
        if c['iso_3166_1' ] == 'US':
            ## save a "certification" key in the info dict with the certification
            movie_info['certification'] = c['certification']
    return movie_info


def write_json(new_data, filename): 
    
    with open(filename,'r+') as file:
        # First we load existing data into a dict.
        file_data = json.load(file)
        ## Choose extend or append
        if (type(new_data) == list) & (type(file_data) == list):
            file_data.extend(new_data)
        else:
            file_data.append(new_data)
        # Sets file's current position at offset.
        file.seek(0)
        # convert back to json.
        json.dump(file_data, file)

## Extract the budget, revenue, and MPAA Rating (G/PG/PG-13/R), which is also called "Certification" for movies that started in 2001 and 2002.

In [2]:
fname= 'Data/title.basics.cleaned.csv'
basics = pd.read_csv(fname, low_memory=False)
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002,NaN,126,Drama

In [18]:
# Set the year to filter for
YEARS_TO_GET = [2001, 2002]
# Create an empty list for saving errors
errors = []

# Start of OUTER loop
for YEAR in tqdm_notebook(YEARS_TO_GET, desc='YEARS', position=0):

    # Define and create the JSON file to store results for the year
    JSON_FILE = f'{FOLDER}tmdb_api_results_{YEAR}.json'
    create_json_file(JSON_FILE)
    
    df = basics[basics['startYear']==YEAR].copy()
    # saving movie ids to list
    movie_ids = df['tconst']
    # Load existing data from json into a dataframe called "previous_df"
    previous_df = pd.read_json(JSON_FILE)
    # filter out any ids that are already in the JSON_FILE
    movie_ids_to_get = movie_ids[~movie_ids.isin(previous_df['imdb_id'])]
    
    # Loop through movie_ids_to_get with a tqdm progress bar
    for movie_id in tqdm_notebook(movie_ids_to_get, f"Movies from {YEAR}"):
    
        # Attempt to retrieve then data for the movie id
        try:
            temp = get_movie_with_rating(movie_id)  #This uses your pre-made function
            # Append/extend results to existing file using a pre-made function
            write_json(temp,JSON_FILE)
            # Short 20 ms sleep to prevent overwhelming server
            time.sleep(0.02)
    
        # If it fails, make a dict with just the id
        except Exception as e:
            errors.append([movie_id, e])
    # summarize the errors       
    print(f"- Total errors: {len(errors)}")

YEARS:   0%|          | 0/2 [00:00<?, ?it/s]

[!] Data/tmdb_api_results_2001.json not found. Saving empty list to new file.

Movies from 2001:   0%|          | 0/1576 [00:00<?, ?it/s]

- Total errors: 226
[!] Data/tmdb_api_results_2002.json not found. Saving empty list to new file.

Movies from 2002:   0%|          | 0/1572 [00:00<?, ?it/s]

- Total errors: 508

In [4]:
# Use glob to get all filepaths that match the pattern (*=wildcard)
tmdb_files = sorted(glob.glob("Data/tmdb_api*.json"))
tmdb_files

['Data\\tmdb_api_results_2001.json', 'Data\\tmdb_api_results_2002.json']

In [27]:
for file in tqdm_notebook(tmdb_files, desc='YEARS'):
    # Save the final results to a csv.gz file
    final_year_df = pd.read_json(file)
    final_year_df.head()
    csv_fname = file.replace('.json','.csv.gz')
    final_year_df.to_csv(csv_fname, compression="gzip", index=False)

YEARS:   0%|          | 0/2 [00:00<?, ?it/s]

In [56]:
tmdb_files = sorted(glob.glob("Data/tmdb_api*.csv.gz"))
df = pd.concat([pd.read_csv(f) for f in tmdb_files])
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2642 entries, 0 to 1290
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   imdb_id                2642 non-null   object
 1   adult                  2640 non-null   float64
 2   backdrop_path          1513 non-null   object
 3   belongs_to_collection  215 non-null    object
 4   budget                 2640 non-null   float64
 5   genres                 2640 non-null   object
 6   homepage               213 non-null    object
 7   id                     2640 non-null   float64
 8   original_language      2640 non-null   object
 9   original_title         2640 non-null   object
 10  overview               2583 non-null   object
 11  popularity             2640 non-null   float64
 12  poster_path            2403 non-null   object
 13  production_companies   2640 non-null   object
 14  production_countries   2640 non-null   object
 15  release_date           2619 non-null   object
 16  revenue                2640 non-null   float64
 17  runtime                2640 non-null   float64
 18  spoken_languages       2640 non-null   object
 19  status                 2640 non-null   object
 20  tagline                1148 non-null   object
 21  title                  2640 non-null   object
 22  video                  2640 non-null   float64
 23  vote_average           2640 non-null   float64
 24  vote_count             2640 non-null   float64
 25  certification          867 non-null    object
dtypes: float64(9), object(17)
memory usage: 557.3+ KB

## Adding more info to the Database
1. Normalizing Genres2. Updateg the MySQL tables

In [10]:
## examining a single value from the genres col
one = basics.loc[0,"genres"]
print(type(one))
one

<class 'str'>

'Comedy,Fantasy,Romance'

In [12]:
basics['genres'] = basics['genres'].str.split(',')
exploded_genres = basics.explode('genres')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
...,...,...,...,...,...,...,...,...,...
86977,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,Action
86977,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,Adventure
86977,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,Thriller
86978,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,Drama
86978,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,History

In [32]:
title_genres=exploded_genres[['tconst','genres']]
title_genres

          tconst     genres
0      tt0035423     Comedy
0      tt0035423    Fantasy
0      tt0035423    Romance
1      tt0062336      Drama
2      tt0069049      Drama
...          ...        ...
86977  tt9916190     Action
86977  tt9916190  Adventure
86977  tt9916190   Thriller
86978  tt9916362      Drama
86978  tt9916362    History

[162600 rows x 2 columns]

In [15]:
## Making the genre mapper dictionary
unique_genres = sorted(title_genres['genres'].unique())
genre_id = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_id))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Sport': 20,
 'Talk-Show': 21,
 'Thriller': 22,
 'War': 23,
 'Western': 24}

In [19]:
genres = pd.DataFrame({'genre_id':genre_map.values(), 'genre_name':genre_map.keys()})
genres

    genre_id  genre_name
0          0      Action
1          1       Adult
2          2   Adventure
3          3   Animation
4          4   Biography
5          5      Comedy
6          6       Crime
7          7       Drama
8          8      Family
9          9     Fantasy
10        10   Game-Show
11        11     History
12        12      Horror
13        13       Music
14        14     Musical
15        15     Mystery
16        16        News
17        17  Reality-TV
18        18     Romance
19        19      Sci-Fi
20        20       Sport
21        21   Talk-Show
22        22    Thriller
23        23         War
24        24     Western

In [49]:
## make new integer genre_id and drop string genres
title_genres = title_genres.replace({'genres':genre_map})
title_genres = title_genres.rename(columns={'genres':'genre_id'})
title_genres

          tconst  genre_id
0      tt0035423         5
0      tt0035423         9
0      tt0035423        18
1      tt0062336         7
2      tt0069049         7
...          ...       ...
86977  tt9916190         0
86977  tt9916190         2
86977  tt9916190        22
86978  tt9916362         7
86978  tt9916362        11

[162600 rows x 2 columns]

In [51]:
from sqlalchemy import create_engine, text
import pymysql
pymysql.install_as_MySQLdb()
# Create the sqlalchemy engine and connection
username = "root"
password = "root" 
# password = quote_plus("Myp@ssword!") # Use the quote function if you have special chars in password
db_name = "movie"
connection = f"mysql+pymysql://{username}:{password}@localhost/{db_name}"
engine = create_engine(connection)
conn = engine.connect()

In [52]:
q = """
SHOW tables;
"""
pd.read_sql(text(q), conn)

  Tables_in_movie
0          genres
1         ratings
2    title_basics
3    title_genres

In [40]:
# Inserting the data now 
genres.to_sql("genres", conn, index=False, if_exists='append')

25

In [41]:
q = """
SELECT * FROM genres LIMIT 5;
"""
pd.read_sql(text(q), conn)

   genre_id genre_name
0         0     Action
1         1      Adult
2         2  Adventure
3         3  Animation
4         4  Biography

In [54]:
# Inserting the data now 
title_genres.to_sql("title_genres", conn, index=False, if_exists='append')

162600

In [55]:
q = """
SELECT * FROM title_genres LIMIT 5;
"""
pd.read_sql(text(q), conn)

      tconst  genre_id
0  tt0035423         5
1  tt0035423         9
2  tt0035423        18
3  tt0062336         7
4  tt0069049         7

## Additionally, you need to create a new table with some of the data from your TMDB API Calls:

Make a "tmdb_data" table, with the following column
```s:
"imdb_id" (movie ids from API. Also the same values as tconst)
"revenue"
"budget"
"certification" (G, PG, PG-13,R,``` etc.)

In [57]:
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
0,0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.328,1232.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG
4,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.405,132.0,PG-13

In [60]:
df['imdb_id'].nunique()

2641

In [63]:
df = df.drop(index=0)
df.head()

,imdb_id,adult,backdrop_path,belongs_to_collection,budget,genres,homepage,id,original_language,original_title,...,revenue,runtime,spoken_languages,status,tagline,title,video,vote_average,vote_count,certification
1,tt0035423,0.0,/hfeiSfWYujh6MKhtGTXyK3DD4nN.jpg,NaN,48000000.0,"[{'id': 10749, 'name': 'Romance'}, {'id': 14, ...",NaN,11232.0,en,Kate & Leopold,...,76019048.0,118.0,"[{'english_name': 'French', 'iso_639_1': 'fr',...",Released,"If they lived in the same century, they'd be p...",Kate & Leopold,0.0,6.328,1232.0,PG-13
2,tt0114447,0.0,NaN,NaN,0.0,"[{'id': 53, 'name': 'Thriller'}, {'id': 28, 'n...",NaN,151007.0,en,The Silent Force,...,0.0,90.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,They left him for dead... They should have fin...,The Silent Force,0.0,5.000,3.0,NaN
3,tt0116916,0.0,/rFpHBidSlhjflmnLu7BZilyKeQR.jpg,NaN,0.0,"[{'id': 28, 'name': 'Action'}, {'id': 12, 'nam...",NaN,73549.0,en,The Dark Mist,...,0.0,101.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,NaN,The Dark Mist,0.0,3.500,2.0,PG
4,tt0118589,0.0,/9NZAirJahVilTiDNCHLFcdkwkiy.jpg,NaN,22000000.0,"[{'id': 18, 'name': 'Drama'}, {'id': 10402, 'n...",NaN,10696.0,en,Glitter,...,5271666.0,104.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,"In music she found her dream, her love, herself.",Glitter,0.0,4.405,132.0,PG-13
5,tt0118652,0.0,/mWxJEFRMvkG4UItYJkRDMgWQ08Y.jpg,NaN,1000000.0,"[{'id': 27, 'name': 'Horror'}, {'id': 9648, 'n...",NaN,17140.0,en,The Attic Expeditions,...,0.0,100.0,"[{'english_name': 'English', 'iso_639_1': 'en'...",Released,His search for peace of mind... will leave his...,The Attic Expeditions,0.0,5.194,31.0,R

In [74]:
q = """
DESCRIBE title_basics;
"""
pd.read_sql(text(q), conn)

           Field          Type Null  Key Default Extra
0         tconst   varchar(45)   NO  PRI    None
1  primary_title  varchar(300)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [66]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
cert_len = df['certification'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
df_schema = {
    "imdb_id": VARCHAR(45), 
    "budget": FLOAT(),
    "revenue": FLOAT(),
    'certification':CHAR(cert_len+1)}

In [70]:
# Save to sql with dtype and index=False
df[["imdb_id","budget","revenue",'certification']].to_sql('tmdb_data', conn, dtype=df_schema, if_exists='replace', index=False)

2640

In [71]:
q = """
SELECT * FROM tmdb_data LIMIT 5;
"""
pd.read_sql(text(q), conn)

     imdb_id      budget     revenue certification
0  tt0035423  48000000.0  76019000.0         PG-13
1  tt0114447         0.0         0.0          None
2  tt0116916         0.0         0.0            PG
3  tt0118589  22000000.0   5271670.0         PG-13
4  tt0118652   1000000.0         0.0             R

In [72]:
# use the sqlalchemy engine to update the table and set the desired column as the primary key
q = """
ALTER TABLE tmdb_data ADD PRIMARY KEY (`imdb_id`)
"""
conn.execute(q)

In [73]:
q = """
DESCRIBE tmdb_data;
"""
pd.read_sql(text(q), conn)

           Field         Type Null  Key Default Extra
0        imdb_id  varchar(45)   NO  PRI    None
1         budget        float  YES         None
2        revenue        float  YES         None
3  certification      char(6)  YES         None